Управление_торговлей.ПБТ/src/Documents/вт_НачислениеЗарплаты/вт_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.вт_НачислениеЗарплаты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеВыработки</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ВидыНоменклатуры</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_НачислениеЗарплаты/вт_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_НачислениеЗарплаты</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Documents/вт_НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.Начисления.Количество() > 0 Тогда
		НаборЗаписей = РегистрыНакопления.вт_НачислениеЗарплаты.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
		Для каждого СТР из ЭтотОбъект.Начисления цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период = ЭтотОбъект.Дата;
			НоваяЗапись.ПериодНачисления = ЭтотОбъект.МесяцНачисления;
			НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка; 
			НоваяЗапись.Организация = ЭтотОбъект.Организация;
			НоваяЗапись.ФизическоеЛицо  = СТР.ФизическоеЛицо;
			НоваяЗапись.СуммаВзаиморасчетов  = СТР.СуммаНачисления;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЭтотОбъект.Начисления.Количество() > 0 Тогда
		НаборЗаписей = РегистрыНакопления.вт_НачислениеЗарплаты.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
